{
  "metadata": {
    "total_size": 14933528576
  },
  "weight_map": {
    "lm_head.weight": "pytorch_model-00002-of-00002.bin",
    "model.embed_tokens.weight": "pytorch_model-00001-of-00002.bin",
    "model.image_tower.image_tower.embeddings.class_embedding": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.embeddings.patch_embedding.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.embeddings.position_embedding.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.0.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.1.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.10.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.11.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.12.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.13.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.14.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.15.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.16.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.17.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.18.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.19.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.2.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.20.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.21.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.22.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.23.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.3.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.4.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.5.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.6.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.7.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.8.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.layer_norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.layer_norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.layer_norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.layer_norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.mlp.fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.mlp.fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.mlp.fc2.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.mlp.fc2.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.self_attn.k_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.self_attn.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.self_attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.self_attn.q_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.self_attn.v_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.encoder.layers.9.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.post_layernorm.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.post_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.pre_layrnorm.bias": "pytorch_model-00002-of-00002.bin",
    "model.image_tower.image_tower.pre_layrnorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.0.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
